% Для сигналов найти свертки в соответствии с заданием. Результаты представить
% графически. Какие свойства свертки иллюстрируются данными примерами?

A = [1,1,1,1,1];
B = [1,2,3,0,0,0];
C = [2,1,0.5];
D = [1,2,3,4,5];
E = [5,4,5,3,1,0];

f1 = conv(A, A);
f2 = conv(B, C);
f3 = conv(C, B);
f4 = conv( conv(D, E), B );
f5 = conv( D, conv(E, B) );
f6 = conv( D, (E + B) );
f7 = conv(D, E) + conv(D, B);

figure();

subplot(4, 2, 1);
stem(f1);
title('Cвойство 1 А*А');

subplot(4, 2, 3);
stem(f2);
title('Коммутативность А*В');

subplot(4, 2, 4);
stem(f3);
title('Коммутативность В*А');

subplot(4, 2, 5);
stem(f4);
title('Ассоциативность (D*E)*B');

subplot(4, 2, 6);
stem(f5);
title('Ассоциативность D*(E*B)');

subplot(4, 2, 7);
stem(f6);
title('Дистрибутивность D*(E+B)');

subplot(4, 2, 8);
stem(f7);
title('Дистрибутивность D*E+D*B');


